## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/10856764853)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 2 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * google_artifact_registry_repository.dockerhub_mirror
* Update
  * google_service_account.sa-gke-kyma-integration
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner
* Replace
  * google_artifact_registry_repository_iam_member.dockerhub_mirror_access



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.dockerhub_mirror will be created
  + resource "google_artifact_registry_repository" "dockerhub_mirror" {
      + create_time      = (known after apply)
      + description      = "Remote repository mirroring Docker Hub"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "europe"
      + mode             = "REMOTE_REPOSITORY"
      + name             = (known after apply)
      + project          = "sap-kyma-prow"
      + repository_id    = "dockerhub-mirror"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + remote_repository_config {
          + description = "Mirror of Docker Hub"

          + docker_repository {
              + public_repository = "DOCKER_HUB"
            }
        }
    }

  # google_artifact_registry_repository_iam_member.dockerhub_mirror_access must be replaced
-/+ resource "google_artifact_registry_repository_iam_member" "dockerhub_mirror_access" {
      ~ etag       = "BwYh/2uuiVU=" -> (known after apply)
      ~ id         = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror/roles/artifactregistry.reader/serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com" -> (known after apply)
      ~ repository = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # google_service_account.sa-gke-kyma-integration will be updated in-place
  ~ resource "google_service_account" "sa-gke-kyma-integration" {
      ~ description  = "Service account is used by Prow to integrate with GKE." -> "Service account is used by Prow to integrate with GKE. Will be removed with Prow"
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # google_artifact_registry_repository.dockerhub_mirror has been deleted
  - resource "google_artifact_registry_repository" "dockerhub_mirror" {
        id                     = "projects/sap-kyma-prow/locations/europe/repositories/dockerhub-mirror"
      - location               = "europe" -> null
      - name                   = "dockerhub-mirror" -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11909,"Program":"tfcmt","SHA1":"df9e27911273be4f7a3dfadb8544b2ce82d5c4f3","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->